RSN/src/Catalogs/КомплектыПоставки/КомплектыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомплектыПоставки</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛицензии</name>
    <type>
      <types>EnumRef.ТипыЛицензий</types>
    </type>
  </attributes>
  <attributes>
    <name>LicData</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКлиентскихСеансов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродукты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пинкоды</name>
    <attributes>
      <name>Пинкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПинкода</name>
      <type>
        <types>EnumRef.СтатусыПинкодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/Пинкод/Пинкод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пинкод</name>
  <attributes>
    <name>СтатусПинкода</name>
    <type>
      <types>EnumRef.СтатусыПинкодов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплектПоставки</name>
    <type>
      <types>CatalogRef.КомплектыПоставки</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/КомплектыПоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ЗаполнитьПинкоды() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пинкод.КомплектПоставки.Ссылка КАК Ссылка,
	|	Пинкод.СтатусПинкода КАК СтатусПинкода,
	|	Пинкод.Наименование КАК Пинкод
	|ИЗ
	|	Справочник.Пинкод КАК Пинкод
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаКомплект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКомплект.Следующий() Цикл
		КомплектПоставки = ВыборкаКомплект.Ссылка.ПолучитьОбъект(); 
		КомплектПоставки.Пинкоды.Очистить();
		Выборка = ВыборкаКомплект.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = КомплектПоставки.Пинкоды.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;
		КомплектПоставки.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
